using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Collections.Generic;
using System.IO;
using System.Transactions;
using Excel = Microsoft.Office.Interop;
using Aspose.Cells;
namespace Final
{
    public static class Transliterator
    {

        //public static string Translate(int line)
        //{
        //    return russian[line];
        //}
        //public static Dictionary<int, string> Dict = new Dictionary<int, string>
        //{
        //    [2] = "Строка 2",
        //    [3] = "Строка 3",
        //    [5] = "Строка 5",

        //};
        //public static Dictionary<int, string> russian = new Dictionary<int, string>
        //{   //То что встретит//то что выдаст
        //    [0] = "Борисенков",
        //    [1] = "Попов",
        //    [2] = "Смирнов",
        //    [3] = "Губин",
        //    [4] = "Петров",
        //    [5] = "Василькова",
        //    [6] = "Соловьёва",
        //    [7] = "Мартинсон",
        //    [8] = "Печёркина",
        //    [9] = "Дорогина",
        //    [10] = "Симанюк"
        //};
        //public static Dictionary<int, string> english = new Dictionary<int, string>
        //{   //То что встретит//то что выдаст
        //    [0] = "Borisenkov",
        //    [1] = "Popov",
        //    [2] = "Smirnov",
        //    [3] = "Gubin",
        //    [4] = "Petrov",
        //    [5] = "Vasilkova",
        //    [6] = "Solovieva",
        //    [7] = "Martinson",
        //    [8] = "Pechеrkina",
        //    [9] = "Dorogina",
        //    [10] = "Symaniuk"
        //};
        public static Dictionary<string, string> Urusification = new Dictionary<string, string>
        {
            {"Ya","Я"},{"ya","я"},{"Ia","Иа"},{"ia","иа"},
            {"Oo","Оо"},{"oo","оо"},{"Ee","Ее"},{"ee","ее"},
            {"Iy","Ий"},{"iy","ий"},{"Yi","йи"},{"yi","йи"},
            {"Yey","Ей"},{"yey","ей"},{"Ey","Ей"},{"ey","ей"},
            {"Uy","Уй"},{"uy","уй"},{"Oy","ой"},{"oy","ой"},
            {"Zh","Ж"},{"zh","ж"},{"Ts","Ц"},{"ts","ц"},
            {"Sh","Ш"},{"sh","ш"},{"Shch","Щ"},{"shch","щ"},
            {"Ch","Ч"},{"ch","ч"},
            {"Ce","Се"},{"ce","се"},{"Cy","Си"},{"cy","си"},{"Ci","Си"},{"ci","си"},
            {"Kh","Х"},{"kh","х"},
            {"Yu","Ю"},{"yu","ю"},{"Iu","Ю"},{"iu","ю"},
            {"Yo","Йо"},{"yo","йо"},
          // лат /рус|лат / рус
            {"A","А"},{"a","а"},//
            {"B","Б"},{"b","б"},//
            {"C","К"},{"c","к"},//
            {"D","Д"},{"d","д"},//
            {"E","Е"},{"e","е"},//
            {"F","Ф"},{"f","ф"},//
            {"G","Г"},{"g","г"},//
            {"H","Х"},{"h","х"},//
            {"I","И"},{"i","и"},//
            {"J","Ж"},{"j","ж"},// 
            {"K","К"},{"k","к"},//
            {"L","л"},{"l","л"},//
            {"M","М"},{"m","м"},//
            {"N","Н"},{"n","н"},//
            {"O","О"},{"o","о"},//
            {"P","П"},{"p","п"},//
            {"Q","Ку"},{"q","ку"},//
            {"R","р"},{"r","р"},//
            {"S","С"},{"s","с"},//
            {"T","Т"},{"t","т"},//
            {"U","У"},{"u","у"},//
            {"V","В"},{"v","в"},//
            {"W","В"},{"w","в"},//
            {"X","Кс"},{"x","кс"},//
            {"Y","И"},{"y","и"},//
            {"Z","з"},{"z","з"},//
        };
        public static Dictionary<string, int> ColumnParser = new Dictionary<string, int>
        {
            {"AA",26},{"AB",27},{"AC",28},{"AD",29},{"AE",30},{"AF",31},{"AG",32},{"AH",33},{"AI",34},
            {"AJ",35},{"AK",36},{"AL",37},{"AM",38},{"AN",39},{"AO",40},{"AP",41},{"AQ",42},{"AR",43},{"AS", 44},
            {"AT",45},{"AU",46},{"AV",47},{"AW",48},{"AX",49},{"AY",50},{"AZ",51},

            {"BA",52},{"BB",53},{"BC",54},{"BD",55},{"BE",56},{"BF",57},{"BG",58},{"BH",59},{"BI",60},
            {"BJ",61},{"BK",62},{"BL",63},{"BM",64},{"BN",65},{"BO",66},{"BP",67},{"BQ",68},{"BR",69},{"BS", 70},
            {"BT",71},{"BU",72},{"BV",73},{"BW",74},{"BX",75},{"BY",76},{"BZ",77},

            {"A",0},{"B",1},{"C",2},{"D",3},{"E",4},{"F",5},{"G",6},{"H",7},{"I",8},
            {"J",9},{"K",10},{"L",11},{"M",12},{"N",13},{"O",14},{"P",15},{"Q",16},{"R",17},{"S", 18},
            {"T",19},{"U",20},{"V",21},{"W",22},{"X",23},{"Y",24},{"Z",25},


        };
        public static Dictionary<int, string> ColumnParserToString = new Dictionary<int, string>
        {
            {0,"A"},{1,"B" },{2,"C"},{3,"D"},{4,"E"},{5,"F"},{6,"G"},{7,"H"},{8,"I"},
            {9,"J"},{10,"K"},{11,"L"},{12,"M"},{13,"N"},{14,"O"},{15,"P"},{16,"Q"},{17,"R"},{18,"S"},
            {19,"T"},{20,"U"},{21,"V"},{22,"W"},{23,"X"},{24,"Y"},{25,"Z"},

            {26,"AA"},{27,"AB"},{28,"AC"},{29,"AD"},{30,"AE"},{31,"AF"},{32,"AG"},{33,"AH"},{34,"AI"},
            {35,"AJ"},{36,"AK"},{37,"AL"},{38,"AM"},{39,"AN"},{40,"AO"},{41,"AP"},{42,"AQ"},{43,"AR"},{44,"AS"},
            {45,"AT"},{46,"AU"},{47,"AV"},{48,"AW"},{49,"AX"},{50,"AY"},{51,"AZ"},

            {52,"BA"},{53,"BB"},{54,"BC"},{55,"BD"},{56,"BE"},{57,"BF"},{58,"BG"},{59,"BH"},{60,"BI"},
            {61,"BJ"},{62,"BK"},{63,"BL"},{64,"BM"},{65,"BN"},{66,"BO"},{67,"BP"},{68,"BQ"},{69,"BR"},{70,"BS"},
            {71,"BT"},{72,"BU"},{73,"BV"},{74,"BW"},{75,"BX"},{76,"BY"},{77,"BZ"},
        };
        public static Dictionary<char, char> BigLettersParser = new Dictionary<char, char>
        {

            {'А','а'},
            {'Б','б'},
            {'В','в'},
            {'Г','г'},
            {'Д','д'},
            {'Е','е'},
            {'Ё','ё'},
            {'Ж','ж'},
            {'З','з'},
            {'И','и'},
            {'Й','й'},
            {'К','к'},
            {'Л','л'},
            {'М','м'},
            {'Н','н'},
            {'О','о'},
            {'П','п'},
            {'Р','р'},
            {'С','с'},
            {'Т','т'},
            {'У','н'},
            {'Ф','ф'},
            {'Х','х'},
            {'Ц','ц'},
            {'Ч','ч'},
            {'Ш','ш'},
            {'Щ','щ'},
            {'Ъ','ъ'},
            {'Ы','ы'},
            {'Ь','ь'},
            {'Э','э'},
            {'Ю','ю'},
            {'Я','я'},
        };
    }
}